Revit 2027 API
BuiltInFailures.MEPFabricationFailures.FabricationStraigtLengthOversized Property
 Fabrication straight exceeds the standard length. Use the Optimize Length command to adjust the length.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId FabricationStraigtLengthOversized { get; }
Public Shared ReadOnly Property FabricationStraigtLengthOversized As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ FabricationStraigtLengthOversized {
	FailureDefinitionId^ get ();
}
static member FabricationStraigtLengthOversized : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.MEPFabricationFailures Class
Autodesk.Revit.DB Namespace